InformationRegisters/НастройкиИнтеграцииСПлатежнымиСистемамиУТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииСПлатежнымиСистемамиУТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Интеграция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКСистемеБыстрыхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежнаяСистема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлатежнойСистемыККТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыПлатежнойСистемыККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыПлатежнойСистемыККТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SWiP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СертификатНСПК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыПроведенияПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыПроведенияПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнтернетЭквайринг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СистемаБыстрыхПлатежейПереопределяемый/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП".
// ОбщийМодуль.СистемаБыстрыхПлатежейПереопределяемый.
//
// Переопределяемые серверные процедуры работы с Системой быстрых платежей:
//  - работа с настройками оплат в прикладной конфигурации;
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область НастройкиПодключения

// Определяет прикладные настройки работы с Системой быстрых платежей.
//
// Параметры:
//  Настройки - Структура - настройки работы с Системой быстрых платежей:
//    * c2b - Структура, Неопределено - настройки выполнения операций c2b:
//      ** ОбъектМетаданных - Метаданные.РегистрыСведений - объект метаданных регистр сведений,
//        в котором хранятся настройки выполнения оплат. Регистр определяет связь торговой точки
//        Системы быстрых платежей и аналитики ведения учета в программах 1С. На основании данных
//        регистра должен выполняется поиск настройки подключения при выполнении
//        оплат и возвратов;
//      ** ИсключаемыеПоля - Массив Из Строка - наименования измерений, ресурсов или реквизитов, которые
//        необходимо скрыть на форме настройки подключения.
//      ** ИспользоватьЧастичныеОплаты - Булево - признак использования функциональности частичных оплат.
//      ** ИспользоватьНастройкуКассовыхСсылок - Булево - признак использования функциональности
//           добавления кассовых ссылок в мастере настройки подключения к СБП.
//      ** ШаблоныНазначений - ТаблицаЗначений - настройки заполнения шаблонов платежей:
//        *** ОбъектМетаданных - Строка - имя объекта метаданных операции.
//        *** Идентификатор - Строка - идентификатор шаблона.
//        *** Наименование - Строка - наименование шаблона для пользователя.
//        *** Параметры - Структура - параметры заполнения шаблона:
//          **** Наименование - Строка - наименование параметра для пользователя.
//          **** Идентификатор - Строка - идентификатор параметра для заполнения.
//            Идентификатор должен быть уникальный для каждого параметра и для всех шаблонов.
//
//@skip-warning
Процедура ПриОпределенииНастроекПодключения(Настройки) Экспорт
	
	//++ Локализация
	ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ;
	Настройки.c2b.Вставить("ОбъектМетаданных", ОбъектМетаданных);
	
	ИсключаемыеПоля  = Новый Массив;
	ИсключаемыеПоля.Добавить("ПлатежнаяСистема");
	
	Настройки.c2b.Вставить("ИсключаемыеПоля",  ИсключаемыеПоля);
	//-- Локализация
	
КонецПроцедуры

// Определяет алгоритм записи настроек оплат в регистр сведений указанный в методе
// СистемаБыстрыхПлатежейПереопределяемый.ПриОпределенииНастроекПодключения.
//
// Параметры:
//  ПараметрыОплаты - Структура - настройки выполнения оплат:
//    * c2b - Соответствие, Неопределено - содержит данные для записи настроек в регистр сведений.
//       Структура параметра соответствует структуре регистра, которая определена
//       в метаданных за исключением полей указанных в настройках в свойстве ИсключаемыеПоля
//       процедуры СистемаБыстрыхПлатежейПереопределяемый.ПриОпределенииНастроекПодключения
//       (см. Настройки.c2b.ОбъектМетаданных).
//  Отказ - Булево - следует устанавливать значение Истина, если в процессе записи возникли ошибки;
//  СообщениеОбОшибке - Строка - сообщение для пользователя. Отображается в случае, если в параметр
//    Отказ установлено значение Истина.
//
Процедура ПриЗаписиНастроекПодключения(
		ПараметрыОплаты,
		Отказ,
		СообщениеОбОшибке) Экспорт
	
	//++ Локализация
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		ПустаяНастройка = Новый Структура("Идентификатор", "");
		
		Договор    = ПараметрыОплаты.c2b.Получить("Договор");
		Интеграция = ПараметрыОплаты.c2b.Получить("Интеграция");
		
		ПлатежнаяСистемаККТ = Перечисления.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей;
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ");
		ЭлементБлокировки.УстановитьЗначение("Договор", Договор);
		
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Если ЗначениеЗаполнено(Интеграция) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор КАК Договор
			|ИЗ
			|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
			|ГДЕ
			|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция = &Интеграция";
			Запрос.УстановитьПараметр("Интеграция", Интеграция);
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Набор = РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.СоздатьНаборЗаписей();
				Набор.Отбор.Договор.Установить(ВыборкаДетальныеЗаписи.Договор);
				Набор.Записать();
			КонецЦикла;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
		|ГДЕ
		|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор = &Договор
		|	И НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция <> &Интеграция
		|	И НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция.Используется";
		Запрос.УстановитьПараметр("Договор",    Договор);
		Запрос.УстановитьПараметр("Интеграция", Интеграция);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			СообщениеОбОшибке = НСтр("ru = 'Для организации и торгового объекта уже задана торговая точка.'");
			ВызватьИсключение СообщениеОбОшибке;
		КонецЕсли;
		
		Запись = РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.СоздатьМенеджерЗаписи();
		Запись.Интеграция       = Интеграция;
		Запись.Договор          = Договор;
		Запись.ПлатежнаяСистема = ПлатежнаяСистемаККТ;
		Запись.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриЗаписиНастроекИнтеграции'"
				, ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Отказ = Истина;
		СообщениеОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	ОбновитьПовторноИспользуемыеЗначения();
	//-- Локализация
	
КонецПроцедуры

// Позволяет настроить элементы настройки приема оплат на формах подключения
// к Системе быстрых платежей.
//
// Параметры:
//  НастройкиФормы - Структура - содержит элементы формы и текущие значения реквизитов:
//    * ОбщиеЭлементы - Структура - общие настройки формы подключения к Системой быстрых платежей:
//      ** Наименование - Элемент - элемент формы, в котором заполняется наименование;
//      ** ДекорацияДополнительнаяИнформация - Элемент - элемент формы, в котором заполняется наименование;
//    * c2b - Структура, Неопределено - настройки элементов и значения настроек для переводов c2b:
//      ** ЭлементыНастроекОплаты - Структура - элементы формы настройки оплаты. Структура параметра
//        соответствует структуре регистра, который определяется в методе
//        СистемаБыстрыхПлатежейПереопределяемый.ПриОпределенииНастроекПодключения, за исключением
//        полей указанных в настройках в свойстве ИсключаемыеПоля.
//      ** ЗначенияНастроекОплаты - Структура - текущее значение реквизитов настроек. Структура параметра
//        соответствует структуре регистра, который определяется в методе
//        СистемаБыстрыхПлатежейПереопределяемый.ПриОпределенииНастроекПодключения, за исключением
//        полей указанных в настройках в свойстве ИсключаемыеПоля;
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей, Неопределено - передается
//     ссылка на настройку подключения, в случае создания новой настройки передается Неопределено.
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные параметры настройки подключения с
//    Системой быстрых платежей, которые передаются в методе СистемаБыстрыхПлатежейКлиент.ПодключитьСистемуБыстрыхПлатежей.
//
//@skip-warning
Процедура ПриНастройкеЭлементовФормыПодключения(
		НастройкиФормы,
		ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	
	ЭлементФормы = НастройкиФормы.c2b.ЭлементыНастроекОплаты.Договор;
	
	СвязиПараметровВыбора = Новый Массив;
	ПараметрыВыбора       = Новый Массив;
	
	Связь = Новый СвязьПараметраВыбора("Отбор.Ссылка", "Договор");
	СвязиПараметровВыбора.Добавить(Связь);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.СпособПроведенияПлатежа", Перечисления.СпособыПроведенияПлатежей.СистемаБыстрыхПлатежей);
	ПараметрыВыбора.Добавить(НовыйПараметр);

	ЭлементФормы.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	ЭлементФормы.ПараметрыВыбора       = Новый ФиксированныйМассив(ПараметрыВыбора);

	//-- Локализация
	
КонецПроцедуры

// Позволяет предзаполнить настройки приема платежей на формах подключения
// к Системе быстрых платежей.
//
// Параметры:
//  Настройки - Структура - содержит элементы формы и текущие значения реквизитов:
//    * ОбщиеНастройки - Структура - общие настройки формы подключения к Системой быстрых платежей:
//      ** Наименование - Строка - значение заполнения поля наименование;
//    * НастройкиОплаты - Структура - значение заполнения реквизитов настройки приема оплат.
//        ** c2b - Структура, Неопределено - значение заполнения реквизитов настройки приема оплат. Структура параметра
//           соответствует структуре регистра, который определяется в методе
//           СистемаБыстрыхПлатежейПереопределяемый.ПриОпределенииНастроекПодключения, за исключением
//           полей указанных в настройках в свойстве ИсключаемыеПоля;
//    * НастройкиУчастникаСБП - Структура - содержит настройки участника СБП:
//      ** Наименование - Строка - наименование участника СБП;
//      ** ИНН - Строка - ИНН участника СБП;
//      ** ПлатежныйАгрегатор - Булево - признак того что участник СБП является платежным агрегатором;
//      ** БИК - Массив из Строка - содержит перечень БИК участника СБП;
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные параметры настройки подключения с
//    Системой быстрых платежей, которые передаются в методе СистемаБыстрыхПлатежейКлиент.ПодключитьСистемуБыстрыхПлатежей.
//
//@skip-warning
Процедура ПриЗаполненииФормыНастройкиПодключения(
		Настройки,
		ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	Если ДополнительныеПараметры <> Неопределено Тогда
		Автонаименование = СтрШаблон(НСтр("ru = '%1'"), ДополнительныеПараметры);
		ЗаполнитьЗначенияСвойств(Настройки.ОбщиеНастройки,  Новый Структура("Наименование", Автонаименование));
		ЗаполнитьЗначенияСвойств(Настройки.НастройкиОплаты.c2b,  Новый Структура("Договор", ДополнительныеПараметры));
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
